# DividedSurfaceCuttingSurfaceMakesMultipleCuts Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DividedSurfaceFailures..::..DividedSurfaceCuttingSurfaceMakesMultipleCuts Property
BuiltInFailures..::..DividedSurfaceFailures Class See Also
---
The surface-based splitter intersects a face to be divided in multiple places and this case is not currently supported
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DividedSurfaceCuttingSurfaceMakesMultipleCuts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfaceCuttingSurfaceMakesMultipleCuts As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DividedSurfaceCuttingSurfaceMakesMultipleCuts {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace